{"CNBC":{"date":"2025-12-01T23:46:06+0000","headline":"Costco sues for Trump tariff refunds before Supreme Court rules on if they're illegal","url":"https://www.cnbc.com/2025/12/01/costco-sues-trump-tariffs-trade-supreme-court.html","content":"In this article\n\nCostco is suing the Trump administration in an effort to get a full refund of new tariffs paid by the warehouse retail giant this year and to block those tariffs from continuing to be imposed as a Supreme Court case plays out.\n\nCostco in the suit notes that it risks losing the money already paid to satisfy the tariffs even if the Supreme Court eventually upholds lower court rulings that found the tariffs were illegally imposed by President Donald Trump.\n\nThe company noted a looming Dec. 15 deadline that could rule out the tariffs that have already been paid being refunded, despite such a ruling by the Supreme Court.\n\nCostco also asks in the suit that a judge enjoin U.S. Customs and Border Protection from continuing to collect the tariffs while the Supreme Court case is pending.\n\nThe suit says CBP denied a request by Costco to extend the deadline for so-called liquidation, which is the final computation of tariffs assessed on imported items.\n\nThe suit was filed in the U.S Court of International Trade. Dozens of other companies have filed similar lawsuits to protect their right to potential refunds in the event of the Supreme Court ruling the tariffs are illegal.\n\nTrump earlier this year imposed wide-ranging tariffs on imports from scores of countries by invoking the International Emergency Economic Powers Act.\n\n\"This Court and the Federal Circuit have cautioned that an importer may lack the legal right to recover refunds of duties for entries that have liquidated, even where the underlying legality of a tariff is later found to be unlawful,\" Costco's suit notes.\n\nWhite House spokesman Kush Desai, in a statement on Costco's suit, said, \"The economic consequences of the failure to uphold President Trump's lawful tariffs are enormous and this suit highlights that fact.\"\n\n\"The White House looks forward to the Supreme Court's speedy and proper resolution of this matter,\" Desai said.\n\nThe Trump administration has warned of the potential fallout of having to refund hundreds of millions of dollars in already paid tariffs if the Supreme Court upholds the lower court rulings that Trump did not have authority under IEEPA to unilaterally impose those duties.\n\nGot a confidential news tip? We want to hear from you.\n\nSign up for free newsletters and get more CNBC delivered to your inbox\n\nGet this delivered to your inbox, and more info about our products and services.\n\n© 2025 Versant Media, LLC. All Rights Reserved. A Versant Media Company.\n\nData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.\n\nData also provided by"},"NovaNews":{"date":"Publisher: Fahmy Macro Wire · 11-15-2025","sentiment":"NVDA 0.82","publisher":"Editors: Sarah Lin, Omar Reyes · Tickers: NVDA, PAL","headline":"NVIDIA x Palantir announce strategic AI partnership","url":"https://portfolio-news-mock.vercel.app/","content":"NVIDIA and Palantir deepen their collaboration around enterprise AI platforms, raising questions about upside for both stocks...\n\nSentiment: NVDA 0.82 · PAL 0.91"}}